Revit 2024 API
ThermalAsset Class
 Represents the properties of a material pertinent to energy analysis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class ThermalAsset : IDisposable
Visual Basic
Public Class ThermalAsset _
	Implements IDisposable
Visual C++
public ref class ThermalAsset : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ThermalAsset
See Also
ThermalAsset Members
Autodesk.Revit.DB Namespace